In [107]:
import numpy as np
import pandas as pd

In [111]:
sozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori":[100,200,300,400]}

In [115]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [117]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [119]:
sozluk2={"Isim":["Ayşe","Levent","Atlas","Fatma"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
         "Kalori":[200,100,50,300]}

In [121]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [127]:
sozluk3={"Isim":["Ayşe","Mahmut","Duygu","Nur"],
         "Spor":["Koşu","Yüzme","Badminton","Tenis"],
         "Kalori":[200,100,50,300]}

In [129]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [131]:
dataFrame2

     Isim       Spor  Kalori
4    Ayşe       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [133]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

## concatenation

In [138]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4     Ayşe       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

## merge

In [141]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
             "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

In [143]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [145]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [147]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atıl"],
             "Kalori":[100,200,150,250]}

In [149]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [151]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [153]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [155]:
maasSozluk={"Isim":["Atıl","Zeynep","Mehmet","Ahmet"],
            "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
            "Maas":[200,300,400,500]}

In [157]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [159]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [161]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [163]:
maasDataFrame["Departman"].nunique()

3

In [165]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [167]:
def bruttenNete(maas):
    return maas*0.66

In [169]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [171]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [185]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"], 
             "Karakter Ismi":["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas":[9,10,50,20,10]}

In [187]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [189]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [199]:
karakterDF.pivot_table(values="Karakter Yas", index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0